<a href="https://colab.research.google.com/github/geovanemelo/data-science/blob/main/Criando_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Criação de df com dicionarios

Uma das estruturas básicas do Python é o Dicionario: A sua converão p/ DataFrame é simples e direta

In [ ]:
#Importando pandas

import pandas as pd

In [ ]:
#Criando dicionarios

dados_dict = {
    "nome": ["Lucas", "Miguel", "Leoni","Felipe"],
    "idade": [14,15,13,15],
    "cidade": ["São Paulo","Piaui","Olinda","Las Vegas"],
    "comprou": [True,False,False,True]

}

In [ ]:
dados_dict

{'cidade': ['São Paulo', 'Piaui', 'Olinda', 'Las Vegas'],
 'comprou': [True, False, False, True],
 'idade': [14, 15, 13, 15],
 'nome': ['Lucas', 'Miguel', 'Leoni', 'Felipe']}

In [ ]:
#criar df
df = pd.DataFrame(dados_dict)

In [ ]:
#Criar id do usuário
id_usuario = [341,212,587,477]

In [ ]:
# associar o id do usuário a lista
df.index = id_usuario

In [ ]:
df

       nome  idade     cidade  comprou
341   Lucas     14  São Paulo     True
212  Miguel     15      Piaui    False
587   Leoni     13     Olinda    False
477  Felipe     15  Las Vegas     True

In [ ]:
# selecionar por id
df.loc[477]

nome          Felipe
idade             15
cidade     Las Vegas
comprou         True
Name: 477, dtype: object

#Criação de dfs com Listas

Outra estrutura muito usuada em py, que pode ser convertidada para df
Para facilitar a conversão, usa-se a função built-in zip().

In [ ]:
# listas
dados_lista = [["Carlos",35,"Araruama",True],["Fernando",31,"Natal",False],["Theo",14,"Fortaleza",False],["Felipe",54,"Orlando",True]]

In [ ]:
# criando df
df = pd.DataFrame(dados_lista, columns=['cidade','idade','cidade','comprou'])
df.index = ['a','b','c','d']

In [ ]:
df

     cidade  idade     cidade  comprou
a    Carlos     35   Araruama     True
b  Fernando     31      Natal    False
c      Theo     14  Fortaleza    False
d    Felipe     54    Orlando     True

#Criando nova coluna
Extramemente conveniente, uma funcionalidade conhecida como broadcasting

In [ ]:
# criar coluna "saldo"
df ['saldo'] = 0.0

In [ ]:
df

     cidade  idade     cidade  comprou  saldo
a    Carlos     35   Araruama     True    0.0
b  Fernando     31      Natal    False    0.0
c      Theo     14  Fortaleza    False    0.0
d    Felipe     54    Orlando     True    0.0